azure/repind-ri-ws/api/ProvideIndividualDataWS/v7/Regression tests/ProvideIndividualData - ALL.bru

meta {
  name: ProvideIndividualData - ALL
  type: http
  seq: 1
}

post {
  url: {{provide-individual-data-v7-url}}
  body: xml
  auth: none
}

headers {
  SOAPAction: "http://www.af-klm.com/services/passenger/ProvideIndividualDataService-v7/provideIndividualDataByIdentifier"
}

body:xml {
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Body>
          <xsd:ProvideIndividualInformationRequestElement xmlns:xsd="http://www.af-klm.com/services/passenger/data-v7/xsd">
              <identificationNumber>{{gin}}</identificationNumber>
              <option>GIN</option>
              <scopeToProvide>ALL</scopeToProvide>
              <requestor>
                  <channel>B2C</channel>
                  <site>QVI</site>
                  <signature>REGRESSION</signature>
              </requestor>
          </xsd:ProvideIndividualInformationRequestElement>
      </soapenv:Body>
  </soapenv:Envelope>
}

vars:pre-request {
  USER: w78574175
  PASSWORD: pswpsw123
  GIN_RCT: 400368475926
  GIN_DEV: 900047984904
}

assert {
  res.status: eq 200
}
