azure/repind-ri-ws/api/ProvideIndividualDataWS/v7/ProvideIndividualData - PING.bru

meta {
  name: ProvideIndividualData - PING
  type: http
  seq: 1
}

post {
  url: {{provide-individual-data-v7-url}}
  body: xml
  auth: none
}

headers {
  SOAPAction: "http://www.af-klm.com/services/passenger/ProvideIndividualDataService-v7/provideIndividualDataByIdentifier"
}

body:xml {
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" >
  <soapenv:Body>
  <ns3:ProvideIndividualInformationRequestElement xmlns:ns6="http://www.af-klm.com/services/passenger/SicCommonType-v1/xsd" xmlns:ns5="http://www.af-klm.com/services/passenger/SoftComputingType-v1/xsd" xmlns:ns7="http://www.af-klm.com/services/passenger/response-v7/xsd" xmlns:ns2="http://www.af-klm.com/services/passenger/SicIndividuType-v3/xsd" xmlns:ns4="http://www.af-klm.com/services/passenger/SicOsirisType-v1/xsd" xmlns:ns3="http://www.af-klm.com/services/passenger/data-v7/xsd">
      <identificationNumber>{{gin}}</identificationNumber>
      <option>GIN</option>
      <requestor>
          <channel>B2C</channel>
          <site>QVI</site>
          <signature>REGRESSION</signature>
      </requestor>
  </ns3:ProvideIndividualInformationRequestElement>
  </soapenv:Body>
  </soapenv:Envelope>
}

vars:pre-request {
  USER: W90000418
  PASSWORD: pswpsw123
  GIN_RCT: 400368475926
  GIN_DEV: 900047984904
}

assert {
  res.status: eq 200
}
